## plan for staging
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_instance_profile.bastion will be created
+   resource "aws_iam_instance_profile" "bastion" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "demo-ecs-staging-bastion-instance-profile"
+       path        = "/"
+       role        = "demo-ecs-staging-bastion"
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # aws_iam_role.bastion will be created
+   resource "aws_iam_role" "bastion" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "demo-ecs-staging-bastion"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.bastion_attach_policy will be created
+   resource "aws_iam_role_policy_attachment" "bastion_attach_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = "demo-ecs-staging-bastion"
    }

  # aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:167259143853:instance/i-0d5fe0dff8cb52fa4" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = "demo-ecs-staging-bastion-instance-profile"
      ~ id                                   = "i-0d5fe0dff8cb52fa4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = "recipe-app-api-devops-bastion" # forces replacement
      ~ monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0e480de7ae426c747" -> (known after apply)
      ~ private_dns                          = "ip-172-31-1-149.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.1.149" -> (known after apply)
      ~ public_dns                           = "ec2-52-16-98-16.eu-west-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.16.98.16" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
-           "default",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-93c028ea" -> "eipalloc-0ddc3f0c9962b81e4" # forces replacement
        tags                                 = {
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Name"        = "demo-ecs-staging-bastion"
            "Owner"       = "email@calvineotieno.com"
            "Project"     = "demo-ecs-devops"
        }
      ~ tenancy                              = "default" -> (known after apply)
+       user_data                            = "309b35916070e41021dd275e5fba2b9ef4bcbbfa"
+       user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
-           "sg-01a16157",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

-       credit_specification {
-           cpu_credits = "standard" -> null
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
+           kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-09e12c2fc96c4b735" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_security_group.bastion will be created
+   resource "aws_security_group" "bastion" {
+       arn                    = (known after apply)
+       description            = "Control bastion inbound and outbound access"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "10.1.10.0/24",
+                   "10.1.11.0/24",
                ]
+               description      = ""
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 5432
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
            },
        ]
+       name                   = "demo-ecs-staging-bastion"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all               = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                 = "vpc-07ea8c24069639ddf"
    }

  # aws_security_group.rds will be updated in-place
  ~ resource "aws_security_group" "rds" {
        id                     = "sg-00811d2064457af61"
      ~ ingress                = [
            # (1 unchanged element hidden)
        ]
        name                   = "demo-ecs-staging-rds-inbound-access"
        tags                   = {
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "email@calvineotieno.com"
            "Project"     = "demo-ecs-devops"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 1 to destroy.

Changes to Outputs:
+   bastion_host = (known after apply)
```